### EDA (Exploratory Data Analysis)

1. load datasets

2. Clean data(missing values, duplicates, types)

3. treat outliers

4. Univariate & bivarites and multivariate analysis

5. insights

 Outlier - A data point that is significantly different from other data point

##### How outliers will come?
1. Measurement errors
2. data entry mistakes

##### why they are important?
1. There can be errors
2. They effect the data analysis part

##### How to identify the outliers?
1. Statistical method
   - > Interquartile range (IQR)
   - > Z-Score
2. Visualization techniques
   - > Box plot
   - > Scatter plot
   - > historgram

### Univariate Analysis - 
*_A method that analysis a single variable to discribe it's characterstics and finding patterns and summarize the data_*

*_It involves one variable_*

### Bivariate Analysis - 
*_it will give relationship between 2 variables._*

*_It helps to find if there is an any correlation between the 2 variables and any association or any connection between the 2 variables_*

*_It involves 2 variables (x&y)_*

### Multivariate Analysis - 
*_To understand how multiple factors interact and influence each other._*

*_It involves more than 2 variables._*

*Example :
How our age,income, and education level influence the purchasing behaviour.*

### ETL - (Extract,Tranform,Load)
### ELT - (Extract, Load, Transform)

### EDA: < Dataset >
1. Load & Overview

2. Cleaning (missing,dupes,dtype) 

3. Univariate , bivarites and multivariate analysis

4. Outliers-IQR

5. Feature Engineering

6. Key Insights

### Feature Engineering - 
***"Feature Engineering is a process of turning raw data into useful features."***

*That helps to improve the perormance machine learning models*

In [2]:
# 1.Load libraries & datasets
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True